---
type: PointOnEdgeFaceIntersection
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# PointOnEdgeFaceIntersection

`Autodesk.Revit.DB.PointOnEdgeFaceIntersection` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetEdgeReference | — | `public Reference GetEdgeReference ()` |
| Method | GetFaceReference | — | `public Reference GetFaceReference ()` |
| Method | SetEdgeReference | — | `public void SetEdgeReference ( Reference edgeReference )` |
| Method | SetFaceReference | — | `public void SetFaceReference ( Reference reference )` |
| Property | OrientWithEdge | — | `public bool OrientWithEdge { get ; set ; }` |